# IsResultAvailable Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BRepBuilder..::..IsResultAvailable Method
BRepBuilder Class See Also
---
A validator function that checks the state of this BRepBuilder object. Returns true if this BRepBuilder object has successfully built a b-rep.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool IsResultAvailable()
```

Visual Basic
---
```text
Public Function IsResultAvailable As Boolean
```

Visual C++
---
```text
public:
bool IsResultAvailable()
```

# ### Return Value
True if this BRepBuilder object has successfully built a b-rep.
# Remarks
The b-rep object may be retrieved via GetResult(). Use this function before calling GetResult() to avoid an exception being thrown.
# See Also
BRepBuilder Class
Autodesk.Revit.DB Namespace